# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [43]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [44]:
baby_names = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv", sep="/t")

C:\Users\Ron Tohar\AppData\Local\Temp\ipykernel_20012\2668092847.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  baby_names = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv", sep="/t")

In [45]:
# did it
def create_df(old_df):
    columns = old_df.columns
    columns = columns[0].split(",")
    values = old_df.iloc[:,0]
    values = [value.split(",") for value in values]
    values

    df = pd.DataFrame(values)
    df.columns = columns
    return df

baby_names = create_df(old_df=baby_names)

### Step 4. See the first 10 entries

In [46]:
baby_names.head(10)

             Id      Name  Year Gender State Count
0  11349  11350      Emma  2004      F    AK    62
1  11350  11351   Madison  2004      F    AK    48
2  11351  11352    Hannah  2004      F    AK    46
3  11352  11353     Grace  2004      F    AK    44
4  11353  11354     Emily  2004      F    AK    41
5  11354  11355   Abigail  2004      F    AK    37
6  11355  11356    Olivia  2004      F    AK    33
7  11356  11357  Isabella  2004      F    AK    30
8  11357  11358    Alyssa  2004      F    AK    29
9  11358  11359    Sophia  2004      F    AK    28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [47]:
baby_names.drop(["","Id"],axis=1)

            Name  Year Gender State Count
0           Emma  2004      F    AK    62
1        Madison  2004      F    AK    48
2         Hannah  2004      F    AK    46
3          Grace  2004      F    AK    44
4          Emily  2004      F    AK    41
...          ...   ...    ...   ...   ...
1016390     Seth  2014      M    WY     5
1016391  Spencer  2014      M    WY     5
1016392     Tyce  2014      M    WY     5
1016393   Victor  2014      M    WY     5
1016394   Waylon  2014      M    WY     5

[1016395 rows x 5 columns]

### Step 6. Is there more male or female names in the dataset?

In [48]:
baby_names['Gender'].value_counts()

Gender
F    558846
M    457549
Name: count, dtype: int64

In [49]:
baby_names.loc[baby_names["Name"] == "Aaden"].Count.sum()

'51528810751320652023125520135158623938283161022976912555162281119201482939131061010618207840651310711111819891013624248561225116661025516177552941157551820962529676713186611527281310765797221055871081388635920161491451433431281051412245953554187661511665665153396514991405626172523862617117811317551923125514'

### Step 7. Group the dataset by name and assign to names

In [50]:
# baby_names[baby_names["gender"] == "F"]
names = baby_names[["Name","Count"]].groupby(["Name"]).sum()
names.head()

                                                     Count
Name
Aaban                                                   66
Aadan                                                 7655
Aadarsh                                                  5
Aaden    5152881075132065202312552013515862393828316102...
Aadhav                                                   6

### Step 8. How many different names exist in the dataset?

In [55]:
names = baby_names["Name"]
unique_names = np.unique(names)
len(unique_names)

17632

### Step 9. What is the name with most occurrences?

In [60]:
baby_names["Name"].value_counts().idxmax()

'Riley'

### Step 10. How many different names have the least occurrences?

In [78]:
lowest = baby_names["Name"].value_counts().min()
names = baby_names["Name"].value_counts()
names[names == lowest].count()

3682

### Step 11. What is the median name occurrence?

In [79]:
baby_names["Name"].value_counts().median()

8.0

### Step 12. What is the standard deviation of names?

In [80]:
baby_names["Name"].value_counts().std()

122.0299635081389

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [81]:
baby_names["Name"].value_counts().describe()

count    17632.000000
mean        57.644907
std        122.029964
min          1.000000
25%          2.000000
50%          8.000000
75%         39.000000
max       1112.000000
Name: count, dtype: float64